<?php
$a1=abs($_POST["a"]);
$b1=abs($_POST["b"]);
$z=abs($a1-$b1)+1;
$d=$_POST["task"];
if ($b1<$a1){
    echo 'Конечное значение отрезка должно быть больше или равно начальному. Повторите ввод. <br>';
}
else {
echo "  Спасибо за заполнение данных. <br>";

if ($d==1){
    $mass[0]=pow ($a1,2);
    $a1++;
    $i=0;
 do{
     $i++;
 $mass[$i]= pow ($a1,2);
 $a1++;
 }  
while ($i<$z);
 }
else {
	$i=0;
    $mass[0]=2*$a1;
    $a1++;
 do{
     $i++;
 $mass[$i]= 2*$a1;
 $a1++;
 }  
while ($i<$z);
 }
 for ($i=0;$i<$z;$i++){
     echo $i.' элемент массива = '.$mass[$i].'<br>';
 }
}
?>